Revit 2027 API
ImporterIFCUtils.UpdateDirectShapeCategory Method
 Updates the category of a DirectShape.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void UpdateDirectShapeCategory(
	DirectShape directShape,
	ElementId newCategoryId
)
Public Shared Sub UpdateDirectShapeCategory (
	directShape As DirectShape,
	newCategoryId As ElementId
)
public:
static void UpdateDirectShapeCategory(
	DirectShape^ directShape,
	ElementId^ newCategoryId
)
static member UpdateDirectShapeCategory :
        directShape : DirectShape *
        newCategoryId : ElementId -> unit
Parameters
directShape DirectShape
 The DirectShape.
newCategoryId ElementId
 The new category id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Use this function carefully, as it could result in a mismatch between DirectShape and DirectShapeType categories.
See Also
Reference
ImporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace